# Pandas Basic Functionality

In [1]:
import numpy as np
import pandas as pd

### Series basic Functionality

In [2]:
arr=np.array([1,2,3,4,5,6,7,8,9])
arr

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [10]:
data={'Name': ['Deepak','Chirag','Ayushi','Ankita','Aman','Ajay'], 'Age':[25, 24, 24, 23, 24, 25], 'Schooking':['KV','Private','SX','Navoday','Private','Public']}
data

{'Name': ['Deepak', 'Chirag', 'Ayushi', 'Ankita', 'Aman', 'Ajay'],
 'Age': [25, 24, 24, 23, 24, 25],
 'Schooking': ['KV', 'Private', 'SX', 'Navoday', 'Private', 'Public']}

In [11]:
dataf = pd.DataFrame(data)
dataf

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

In [3]:
sarr= pd.Series(arr)
sarr

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

#### AXES

In [4]:
sarr.axes

[RangeIndex(start=0, stop=9, step=1)]

#### EMPTY [Return boolen values True:False]

In [5]:
sarr.empty

False

#### NDIM [Return Dimensions]

In [6]:
sarr.ndim

1

#### Size [Return length of series(number of rows)]

In [7]:
sarr.size

9

#### Values [Return elements of Series]

In [8]:
sarr.values

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [9]:
sarr

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

#### Head and Tail [Return small view of DataFrame or Series]

In [12]:
sarr.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
dataf.head()

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private

In [14]:
sarr.head(2)

0    1
1    2
dtype: int64

In [15]:
dataf.head(2)

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private

In [16]:
sarr.tail()

4    5
5    6
6    7
7    8
8    9
dtype: int64

In [17]:
sarr.tail(2)

7    8
8    9
dtype: int64

In [18]:
dataf.tail()

     Name  Age Schooking
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

In [19]:
dataf.tail(3)

     Name  Age Schooking
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

## DataFrame Basic Functionality

In [20]:
dataf

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

In [21]:
dataf.T

                0        1       2        3        4       5
Name       Deepak   Chirag  Ayushi   Ankita     Aman    Ajay
Age            25       24      24       23       24      25
Schooking      KV  Private      SX  Navoday  Private  Public

In [23]:
dataf

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

In [24]:
dataf.axes

[RangeIndex(start=0, stop=6, step=1),
 Index(['Name', 'Age', 'Schooking'], dtype='object')]

In [25]:
dataf.empty

False

In [26]:
dataf.ndim

2

In [27]:
dataf.values

array([['Deepak', 25, 'KV'],
       ['Chirag', 24, 'Private'],
       ['Ayushi', 24, 'SX'],
       ['Ankita', 23, 'Navoday'],
       ['Aman', 24, 'Private'],
       ['Ajay', 25, 'Public']], dtype=object)

In [28]:
dataf.head(3)

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX

In [29]:
dataf.tail(2)

   Name  Age Schooking
4  Aman   24   Private
5  Ajay   25    Public

In [30]:
dataf.size

18

In [31]:
dataf

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

In [32]:
dataf.shape

(6, 3)

In [34]:
dataf.dtypes

Name         object
Age           int64
Schooking    object
dtype: object